[
  {
    "id": "jp-001",
    "title": "Senior Full Stack Developer",
    "description": "We're looking for a Senior Full Stack Developer to join our growing engineering team. You'll be responsible for designing, developing, and maintaining our AI-powered enterprise solutions. This role involves working with cutting-edge technologies and collaborating with cross-functional teams to deliver high-quality software products.",
    "requirements": "Bachelor's degree in Computer Science or related field, 5+ years of experience in full-stack development, proficiency in React, Node.js, and Python, experience with cloud platforms (AWS/Azure), strong problem-solving skills, and excellent communication abilities.",
    "responsibilities": "Design and implement scalable web applications, collaborate with product managers and designers, mentor junior developers, participate in code reviews, optimize application performance, and contribute to technical architecture decisions.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 120000,
    "salary_max": 160000,
    "salary_currency": "USD",
    "location": "San Francisco, CA",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-15T23:59:59Z",
    "application_deadline": "2024-04-10T23:59:59Z",
    "view_count": 245,
    "application_count": 18,
    "published_at": "2024-01-10T09:00:00Z",
    "archived_at": null,
    "employer_id": "ep-001",
    "created_at": "2024-01-10T08:00:00Z",
    "updated_at": "2024-01-15T14:45:00Z"
  },
  {
    "id": "jp-002",
    "title": "AI/ML Engineer",
    "description": "Join our AI team to develop and deploy machine learning models that power our enterprise solutions. You'll work on cutting-edge AI technologies, from natural language processing to computer vision, and help scale our AI infrastructure to serve millions of users.",
    "requirements": "Master's degree in Computer Science, Statistics, or related field, 3+ years of experience in machine learning, proficiency in Python, TensorFlow/PyTorch, experience with MLOps and cloud platforms, strong mathematical background, and experience with large-scale data processing.",
    "responsibilities": "Develop and train machine learning models, design and implement AI pipelines, collaborate with data scientists and engineers, optimize model performance, deploy models to production, and stay current with AI/ML research and trends.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 100000,
    "salary_max": 140000,
    "salary_currency": "USD",
    "location": "Austin, TX",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-20T23:59:59Z",
    "application_deadline": "2024-04-15T23:59:59Z",
    "view_count": 189,
    "application_count": 12,
    "published_at": "2024-01-12T10:30:00Z",
    "archived_at": null,
    "employer_id": "ep-001",
    "created_at": "2024-01-12T09:30:00Z",
    "updated_at": "2024-01-15T14:45:00Z"
  },
  {
    "id": "jp-003",
    "title": "DevOps Engineer",
    "description": "Help us build and maintain our cloud infrastructure and deployment pipelines. You'll work on automating our development processes, ensuring high availability and scalability of our services, and implementing best practices for security and monitoring.",
    "requirements": "Bachelor's degree in Computer Science or related field, 3+ years of experience in DevOps, proficiency in Docker, Kubernetes, and AWS, experience with CI/CD pipelines, knowledge of infrastructure as code, and strong scripting skills in Python or Bash.",
    "responsibilities": "Design and implement cloud infrastructure, automate deployment and scaling processes, monitor system performance and security, collaborate with development teams, maintain documentation, and implement disaster recovery procedures.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 90000,
    "salary_max": 130000,
    "salary_currency": "USD",
    "location": "Remote",
    "is_remote": true,
    "remote_type": "FULLY_REMOTE",
    "status": "PUBLISHED",
    "expires_at": "2024-04-25T23:59:59Z",
    "application_deadline": "2024-04-20T23:59:59Z",
    "view_count": 156,
    "application_count": 8,
    "published_at": "2024-01-08T11:00:00Z",
    "archived_at": null,
    "employer_id": "ep-001",
    "created_at": "2024-01-08T10:00:00Z",
    "updated_at": "2024-01-15T11:20:00Z"
  },
  {
    "id": "jp-004",
    "title": "Senior Business Consultant",
    "description": "Lead strategic consulting engagements for Fortune 500 clients across various industries. You'll analyze business processes, identify improvement opportunities, and develop comprehensive solutions that drive measurable results and organizational transformation.",
    "requirements": "Master's degree in Business Administration, Economics, or related field, 7+ years of consulting experience, strong analytical and problem-solving skills, excellent communication and presentation abilities, experience with change management, and proven track record of client success.",
    "responsibilities": "Lead client engagements and project teams, conduct business analysis and process optimization, develop strategic recommendations and implementation plans, manage client relationships, mentor junior consultants, and contribute to business development efforts.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 130000,
    "salary_max": 180000,
    "salary_currency": "USD",
    "location": "New York, NY",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-30T23:59:59Z",
    "application_deadline": "2024-04-25T23:59:59Z",
    "view_count": 98,
    "application_count": 5,
    "published_at": "2024-01-14T13:00:00Z",
    "archived_at": null,
    "employer_id": "ep-002",
    "created_at": "2024-01-14T12:00:00Z",
    "updated_at": "2024-01-15T11:20:00Z"
  },
  {
    "id": "jp-005",
    "title": "Data Analyst",
    "description": "Transform raw data into actionable insights that drive business decisions. You'll work with large datasets, develop analytical models, and create compelling visualizations that help stakeholders understand complex business trends and opportunities.",
    "requirements": "Bachelor's degree in Statistics, Mathematics, Economics, or related field, 2+ years of experience in data analysis, proficiency in SQL, Python, and R, experience with data visualization tools, strong statistical analysis skills, and excellent communication abilities.",
    "responsibilities": "Analyze business data and create reports, develop predictive models and forecasting, create data visualizations and dashboards, collaborate with business stakeholders, ensure data quality and accuracy, and present findings to leadership teams.",
    "employment_type": "FULL_TIME",
    "experience_level": "ENTRY",
    "salary_min": 65000,
    "salary_max": 85000,
    "salary_currency": "USD",
    "location": "London, UK",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-18T23:59:59Z",
    "application_deadline": "2024-04-13T23:59:59Z",
    "view_count": 134,
    "application_count": 9,
    "published_at": "2024-01-09T14:00:00Z",
    "archived_at": null,
    "employer_id": "ep-002",
    "created_at": "2024-01-09T13:00:00Z",
    "updated_at": "2024-01-15T13:15:00Z"
  },
  {
    "id": "jp-006",
    "title": "Project Manager",
    "description": "Manage complex international projects across multiple time zones and cultures. You'll coordinate with diverse teams, ensure project delivery on time and within budget, and maintain high standards of quality while managing stakeholder expectations.",
    "requirements": "Bachelor's degree in Project Management, Business, or related field, 5+ years of project management experience, PMP certification preferred, experience with international projects, strong leadership and communication skills, and proficiency in project management tools.",
    "responsibilities": "Plan and execute project activities, manage project budgets and timelines, coordinate with cross-functional teams, communicate with stakeholders, identify and mitigate risks, ensure quality deliverables, and maintain project documentation.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 80000,
    "salary_max": 110000,
    "salary_currency": "USD",
    "location": "Tokyo, Japan",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-22T23:59:59Z",
    "application_deadline": "2024-04-17T23:59:59Z",
    "view_count": 167,
    "application_count": 14,
    "published_at": "2024-01-11T15:30:00Z",
    "archived_at": null,
    "employer_id": "ep-002",
    "created_at": "2024-01-11T14:30:00Z",
    "updated_at": "2024-01-15T13:15:00Z"
  },
  {
    "id": "jp-007",
    "title": "Product Designer",
    "description": "Create innovative and user-centered product designs that solve real-world problems. You'll work on the entire design process from research and ideation to prototyping and user testing, collaborating with cross-functional teams to bring ideas to life.",
    "requirements": "Bachelor's degree in Design, Human-Computer Interaction, or related field, 4+ years of product design experience, proficiency in Figma, Sketch, and Adobe Creative Suite, experience with user research and testing, strong portfolio, and excellent communication skills.",
    "responsibilities": "Conduct user research and create personas, design user interfaces and experiences, create wireframes and prototypes, collaborate with product managers and developers, conduct user testing and iterate designs, and maintain design systems and guidelines.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 85000,
    "salary_max": 120000,
    "salary_currency": "USD",
    "location": "Seattle, WA",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-28T23:59:59Z",
    "application_deadline": "2024-04-23T23:59:59Z",
    "view_count": 223,
    "application_count": 16,
    "published_at": "2024-01-13T16:00:00Z",
    "archived_at": null,
    "employer_id": "ep-003",
    "created_at": "2024-01-13T15:00:00Z",
    "updated_at": "2024-01-15T15:30:00Z"
  },
  {
    "id": "jp-008",
    "title": "UX Researcher",
    "description": "Drive product decisions through deep user insights and research. You'll design and conduct user studies, analyze user behavior data, and provide actionable recommendations that improve user experience and product success.",
    "requirements": "Master's degree in Psychology, Human-Computer Interaction, or related field, 3+ years of UX research experience, proficiency in research methodologies and tools, experience with qualitative and quantitative research, strong analytical skills, and excellent communication abilities.",
    "responsibilities": "Design and conduct user research studies, analyze user behavior and feedback, create research reports and presentations, collaborate with design and product teams, develop user personas and journey maps, and advocate for user-centered design decisions.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 75000,
    "salary_max": 105000,
    "salary_currency": "USD",
    "location": "Portland, OR",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-26T23:59:59Z",
    "application_deadline": "2024-04-21T23:59:59Z",
    "view_count": 145,
    "application_count": 7,
    "published_at": "2024-01-15T17:00:00Z",
    "archived_at": null,
    "employer_id": "ep-003",
    "created_at": "2024-01-15T16:00:00Z",
    "updated_at": "2024-01-15T15:30:00Z"
  },
  {
    "id": "jp-009",
    "title": "Innovation Manager",
    "description": "Lead our innovation initiatives and drive creative problem-solving across the organization. You'll identify emerging trends, develop new product concepts, and foster a culture of innovation that keeps us ahead of the competition.",
    "requirements": "Bachelor's degree in Business, Engineering, or related field, 5+ years of experience in innovation or product development, experience with design thinking and innovation methodologies, strong strategic thinking skills, and excellent leadership and communication abilities.",
    "responsibilities": "Lead innovation workshops and brainstorming sessions, identify and evaluate new opportunities, develop innovation strategies and roadmaps, collaborate with cross-functional teams, manage innovation projects, and foster creative culture within the organization.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 95000,
    "salary_max": 130000,
    "salary_currency": "USD",
    "location": "Vancouver, BC",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-24T23:59:59Z",
    "application_deadline": "2024-04-19T23:59:59Z",
    "view_count": 112,
    "application_count": 6,
    "published_at": "2024-01-16T18:00:00Z",
    "archived_at": null,
    "employer_id": "ep-003",
    "created_at": "2024-01-16T17:00:00Z",
    "updated_at": "2024-01-15T15:30:00Z"
  },
  {
    "id": "jp-010",
    "title": "Manufacturing Engineer",
    "description": "Optimize our manufacturing processes and improve production efficiency. You'll design and implement manufacturing systems, reduce costs, ensure quality standards, and drive continuous improvement initiatives across our production facilities.",
    "requirements": "Bachelor's degree in Manufacturing Engineering, Mechanical Engineering, or related field, 4+ years of manufacturing experience, knowledge of lean manufacturing principles, experience with CAD software, strong problem-solving skills, and understanding of quality management systems.",
    "responsibilities": "Design and optimize manufacturing processes, implement lean manufacturing principles, reduce production costs and improve efficiency, ensure quality standards and safety compliance, collaborate with production teams, and drive continuous improvement initiatives.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 70000,
    "salary_max": 95000,
    "salary_currency": "USD",
    "location": "Chicago, IL",
    "is_remote": false,
    "remote_type": "OFFICE_ONLY",
    "status": "PUBLISHED",
    "expires_at": "2024-04-29T23:59:59Z",
    "application_deadline": "2024-04-24T23:59:59Z",
    "view_count": 89,
    "application_count": 4,
    "published_at": "2024-01-17T19:00:00Z",
    "archived_at": null,
    "employer_id": "ep-004",
    "created_at": "2024-01-17T18:00:00Z",
    "updated_at": "2024-01-15T16:45:00Z"
  },
  {
    "id": "jp-011",
    "title": "Quality Assurance Manager",
    "description": "Lead our quality assurance efforts and ensure our products meet the highest standards. You'll develop quality control procedures, manage quality teams, conduct audits, and drive quality improvement initiatives across all manufacturing operations.",
    "requirements": "Bachelor's degree in Quality Management, Engineering, or related field, 6+ years of quality assurance experience, knowledge of ISO standards and quality management systems, experience with statistical process control, strong leadership skills, and attention to detail.",
    "responsibilities": "Develop and implement quality control procedures, manage quality assurance teams, conduct quality audits and inspections, analyze quality data and trends, collaborate with production and engineering teams, and drive quality improvement initiatives.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 85000,
    "salary_max": 115000,
    "salary_currency": "USD",
    "location": "Houston, TX",
    "is_remote": false,
    "remote_type": "OFFICE_ONLY",
    "status": "PUBLISHED",
    "expires_at": "2024-04-27T23:59:59Z",
    "application_deadline": "2024-04-22T23:59:59Z",
    "view_count": 76,
    "application_count": 3,
    "published_at": "2024-01-18T20:00:00Z",
    "archived_at": null,
    "employer_id": "ep-004",
    "created_at": "2024-01-18T19:00:00Z",
    "updated_at": "2024-01-15T16:45:00Z"
  },
  {
    "id": "jp-012",
    "title": "Supply Chain Analyst",
    "description": "Optimize our supply chain operations and improve inventory management. You'll analyze supply chain data, identify optimization opportunities, develop forecasting models, and implement strategies that reduce costs and improve efficiency.",
    "requirements": "Bachelor's degree in Supply Chain Management, Business, or related field, 3+ years of supply chain experience, proficiency in Excel and supply chain software, experience with demand forecasting, strong analytical skills, and knowledge of supply chain best practices.",
    "responsibilities": "Analyze supply chain performance and identify optimization opportunities, develop demand forecasting models, optimize inventory levels and reorder points, collaborate with suppliers and logistics partners, monitor supply chain metrics, and implement cost reduction strategies.",
    "employment_type": "FULL_TIME",
    "experience_level": "ENTRY",
    "salary_min": 55000,
    "salary_max": 75000,
    "salary_currency": "USD",
    "location": "Detroit, MI",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-23T23:59:59Z",
    "application_deadline": "2024-04-18T23:59:59Z",
    "view_count": 134,
    "application_count": 11,
    "published_at": "2024-01-19T21:00:00Z",
    "archived_at": null,
    "employer_id": "ep-004",
    "created_at": "2024-01-19T20:00:00Z",
    "updated_at": "2024-01-15T16:45:00Z"
  },
  {
    "id": "jp-013",
    "title": "Blockchain Developer",
    "description": "Build the future of financial technology with blockchain and cryptocurrency solutions. You'll develop smart contracts, decentralized applications, and blockchain infrastructure that revolutionizes how people interact with financial services.",
    "requirements": "Bachelor's degree in Computer Science or related field, 3+ years of experience in blockchain development, proficiency in Solidity, JavaScript, and Python, experience with Ethereum, Bitcoin, or other blockchain platforms, knowledge of cryptography and distributed systems.",
    "responsibilities": "Develop smart contracts and decentralized applications, design and implement blockchain solutions, conduct security audits and testing, collaborate with product teams, optimize blockchain performance, and stay current with blockchain technology trends.",
    "employment_type": "FULL_TIME",
    "experience_level": "MID",
    "salary_min": 110000,
    "salary_max": 150000,
    "salary_currency": "USD",
    "location": "Miami, FL",
    "is_remote": true,
    "remote_type": "FULLY_REMOTE",
    "status": "PUBLISHED",
    "expires_at": "2024-04-21T23:59:59Z",
    "application_deadline": "2024-04-16T23:59:59Z",
    "view_count": 198,
    "application_count": 15,
    "published_at": "2024-01-20T22:00:00Z",
    "archived_at": null,
    "employer_id": "ep-005",
    "created_at": "2024-01-20T21:00:00Z",
    "updated_at": "2024-01-15T17:15:00Z"
  },
  {
    "id": "jp-014",
    "title": "Financial Risk Analyst",
    "description": "Analyze financial risks and develop strategies to protect our digital payment platform. You'll work with large datasets to identify fraud patterns, assess credit risks, and develop models that ensure the security and stability of our financial services.",
    "requirements": "Bachelor's degree in Finance, Economics, Statistics, or related field, 4+ years of experience in financial risk analysis, proficiency in Python, R, and SQL, experience with machine learning for risk modeling, knowledge of financial regulations, and strong analytical skills.",
    "responsibilities": "Develop risk assessment models and fraud detection systems, analyze financial data and market trends, create risk reports and recommendations, collaborate with compliance and security teams, monitor risk metrics and KPIs, and implement risk mitigation strategies.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 95000,
    "salary_max": 130000,
    "salary_currency": "USD",
    "location": "Remote",
    "is_remote": true,
    "remote_type": "FULLY_REMOTE",
    "status": "PUBLISHED",
    "expires_at": "2024-04-19T23:59:59Z",
    "application_deadline": "2024-04-14T23:59:59Z",
    "view_count": 167,
    "application_count": 9,
    "published_at": "2024-01-21T23:00:00Z",
    "archived_at": null,
    "employer_id": "ep-005",
    "created_at": "2024-01-21T22:00:00Z",
    "updated_at": "2024-01-15T17:15:00Z"
  },
  {
    "id": "jp-015",
    "title": "Product Manager",
    "description": "Lead product strategy and development for our fintech platform. You'll work with cross-functional teams to define product vision, prioritize features, and deliver innovative financial solutions that meet customer needs and drive business growth.",
    "requirements": "Bachelor's degree in Business, Computer Science, or related field, 5+ years of product management experience, experience in fintech or financial services, strong analytical and strategic thinking skills, excellent communication abilities, and proven track record of product success.",
    "responsibilities": "Define product strategy and roadmap, gather and analyze customer requirements, prioritize features and development efforts, collaborate with engineering and design teams, conduct market research and competitive analysis, and measure product performance and success metrics.",
    "employment_type": "FULL_TIME",
    "experience_level": "SENIOR",
    "salary_min": 100000,
    "salary_max": 140000,
    "salary_currency": "USD",
    "location": "Miami, FL",
    "is_remote": true,
    "remote_type": "HYBRID",
    "status": "PUBLISHED",
    "expires_at": "2024-04-17T23:59:59Z",
    "application_deadline": "2024-04-12T23:59:59Z",
    "view_count": 145,
    "application_count": 7,
    "published_at": "2024-01-22T24:00:00Z",
    "archived_at": null,
    "employer_id": "ep-005",
    "created_at": "2024-01-22T23:00:00Z",
    "updated_at": "2024-01-15T17:15:00Z"
  }
]