[
  {
    "id": "app-001",
    "job_seeker_id": "js-001",
    "job_posting_id": "jp-001",
    "cover_letter": "Dear Hiring Manager, I am excited to apply for the Senior Full Stack Developer position at TechCorp. With over 5 years of experience in full-stack development using React, Node.js, and Python, I believe I would be a great fit for your team. I have successfully led the development of scalable web applications and have experience mentoring junior developers. I am particularly drawn to your AI-powered enterprise solutions and would love to contribute to cutting-edge technology projects.",
    "salary_expectation": 140000,
    "status": "UNDER_REVIEW",
    "applied_at": "2024-01-20T14:30:00Z",
    "notes": "Strong technical background, good cultural fit",
    "created_at": "2024-01-20T14:30:00Z",
    "updated_at": "2024-01-22T09:15:00Z"
  },
  {
    "id": "app-002",
    "job_seeker_id": "js-001",
    "job_posting_id": "jp-003",
    "cover_letter": "I am applying for the DevOps Engineer position. While my primary experience is in full-stack development, I have extensive experience with Docker, AWS, and CI/CD pipelines. I have automated deployment processes and implemented monitoring solutions in my previous roles. I am eager to expand my DevOps skills and contribute to building robust cloud infrastructure.",
    "salary_expectation": 110000,
    "status": "SUBMITTED",
    "applied_at": "2024-01-25T11:45:00Z",
    "notes": "Good potential, needs DevOps experience",
    "created_at": "2024-01-25T11:45:00Z",
    "updated_at": "2024-01-25T11:45:00Z"
  },
  {
    "id": "app-003",
    "job_seeker_id": "js-001",
    "job_posting_id": "jp-007",
    "cover_letter": "I am interested in the Product Designer position. While my background is in development, I have a strong passion for user experience and have collaborated closely with designers throughout my career. I understand the technical constraints and can bridge the gap between design and implementation. I am excited about the opportunity to focus on creating user-centered product designs.",
    "salary_expectation": 95000,
    "status": "REJECTED",
    "applied_at": "2024-01-28T16:20:00Z",
    "notes": "Not enough design experience",
    "created_at": "2024-01-28T16:20:00Z",
    "updated_at": "2024-02-01T10:30:00Z"
  },
  {
    "id": "app-004",
    "job_seeker_id": "js-002",
    "job_posting_id": "jp-007",
    "cover_letter": "I am thrilled to apply for the Product Designer position. With over 6 years of experience in UX/UI design, I have led design teams and created intuitive digital experiences for multiple startups and established companies. I am proficient in Figma, Sketch, and user research methodologies. I am particularly excited about the opportunity to work on innovative product designs that solve real-world problems.",
    "salary_expectation": 115000,
    "status": "INTERVIEWED",
    "applied_at": "2024-01-21T13:15:00Z",
    "notes": "Excellent portfolio, strong interview performance",
    "created_at": "2024-01-21T13:15:00Z",
    "updated_at": "2024-01-30T14:45:00Z"
  },
  {
    "id": "app-005",
    "job_seeker_id": "js-002",
    "job_posting_id": "jp-008",
    "cover_letter": "I am applying for the UX Researcher position. My experience in UX/UI design has given me a strong foundation in understanding user needs and behaviors. I have conducted user research studies and created user personas and journey maps. I am excited about the opportunity to focus specifically on research and provide data-driven insights that improve user experience.",
    "salary_expectation": 90000,
    "status": "SUBMITTED",
    "applied_at": "2024-01-26T10:30:00Z",
    "notes": "Good UX background, transitioning to research",
    "created_at": "2024-01-26T10:30:00Z",
    "updated_at": "2024-01-26T10:30:00Z"
  },
  {
    "id": "app-006",
    "job_seeker_id": "js-002",
    "job_posting_id": "jp-004",
    "cover_letter": "I am interested in the Senior Business Consultant position. While my background is in design, I have strong analytical and problem-solving skills. I have worked with clients to understand their needs and develop solutions that meet their business objectives. I am excited about the opportunity to apply my strategic thinking and communication skills in a consulting role.",
    "salary_expectation": 120000,
    "status": "REJECTED",
    "applied_at": "2024-01-29T15:45:00Z",
    "notes": "Not enough consulting experience",
    "created_at": "2024-01-29T15:45:00Z",
    "updated_at": "2024-02-02T11:20:00Z"
  },
  {
    "id": "app-007",
    "job_seeker_id": "js-003",
    "job_posting_id": "jp-002",
    "cover_letter": "I am excited to apply for the AI/ML Engineer position. With a Master's degree in Computer Science and 4 years of experience in machine learning, I have developed and deployed predictive models and AI pipelines. I am proficient in Python, TensorFlow, and have experience with MLOps. I am particularly interested in working on cutting-edge AI technologies and scaling AI infrastructure.",
    "salary_expectation": 125000,
    "status": "OFFERED",
    "applied_at": "2024-01-19T09:00:00Z",
    "notes": "Perfect match for the role, excellent technical skills",
    "created_at": "2024-01-19T09:00:00Z",
    "updated_at": "2024-01-31T16:30:00Z"
  },
  {
    "id": "app-008",
    "job_seeker_id": "js-003",
    "job_posting_id": "jp-005",
    "cover_letter": "I am applying for the Data Analyst position. While my primary experience is in machine learning, I have strong skills in data analysis, SQL, and statistical analysis. I have created data visualizations and dashboards to communicate complex findings to stakeholders. I am excited about the opportunity to focus on data analysis and provide actionable business insights.",
    "salary_expectation": 75000,
    "status": "WITHDRAWN",
    "applied_at": "2024-01-24T12:00:00Z",
    "notes": "Candidate withdrew after receiving another offer",
    "created_at": "2024-01-24T12:00:00Z",
    "updated_at": "2024-01-31T16:30:00Z"
  },
  {
    "id": "app-009",
    "job_seeker_id": "js-003",
    "job_posting_id": "jp-001",
    "cover_letter": "I am interested in the Senior Full Stack Developer position. While my background is in data science and machine learning, I have strong programming skills in Python and JavaScript. I have built web applications and APIs for data visualization and model deployment. I am excited about the opportunity to work on full-stack development and contribute to AI-powered solutions.",
    "salary_expectation": 130000,
    "status": "SUBMITTED",
    "applied_at": "2024-01-27T14:20:00Z",
    "notes": "Strong technical skills, transitioning from ML to full-stack",
    "created_at": "2024-01-27T14:20:00Z",
    "updated_at": "2024-01-27T14:20:00Z"
  },
  {
    "id": "app-010",
    "job_seeker_id": "js-004",
    "job_posting_id": "jp-004",
    "cover_letter": "I am excited to apply for the Senior Business Consultant position. With 7+ years of experience in product management, I have led strategic initiatives and worked with Fortune 500 clients. I have strong analytical skills and have successfully launched products that drove measurable business results. I am excited about the opportunity to apply my strategic thinking in a consulting role.",
    "salary_expectation": 150000,
    "status": "INTERVIEWED",
    "applied_at": "2024-01-22T11:30:00Z",
    "notes": "Strong business background, good fit for consulting",
    "created_at": "2024-01-22T11:30:00Z",
    "updated_at": "2024-01-29T13:45:00Z"
  },
  {
    "id": "app-011",
    "job_seeker_id": "js-004",
    "job_posting_id": "jp-006",
    "cover_letter": "I am applying for the Project Manager position. My experience in product management has given me strong project management skills. I have coordinated cross-functional teams, managed budgets and timelines, and ensured successful project delivery. I am excited about the opportunity to focus specifically on project management and work on international projects.",
    "salary_expectation": 95000,
    "status": "SUBMITTED",
    "applied_at": "2024-01-25T16:45:00Z",
    "notes": "Good project management experience from product role",
    "created_at": "2024-01-25T16:45:00Z",
    "updated_at": "2024-01-25T16:45:00Z"
  },
  {
    "id": "app-012",
    "job_seeker_id": "js-004",
    "job_posting_id": "jp-005",
    "cover_letter": "I am interested in the Data Analyst position. My experience in product management has given me strong analytical skills. I have worked with large datasets to make data-driven product decisions and have created reports and dashboards for stakeholders. I am excited about the opportunity to focus specifically on data analysis and provide insights that drive business decisions.",
    "salary_expectation": 80000,
    "status": "REJECTED",
    "applied_at": "2024-01-28T10:15:00Z",
    "notes": "Overqualified for entry-level position",
    "created_at": "2024-01-28T10:15:00Z",
    "updated_at": "2024-02-01T09:30:00Z"
  },
  {
    "id": "app-013",
    "job_seeker_id": "js-005",
    "job_posting_id": "jp-003",
    "cover_letter": "I am excited to apply for the DevOps Engineer position. With 5+ years of experience in DevOps and site reliability engineering, I have expertise in cloud infrastructure, CI/CD pipelines, and monitoring systems. I have worked with AWS, Kubernetes, Docker, and infrastructure as code. I am excited about the opportunity to help build and maintain robust cloud infrastructure.",
    "salary_expectation": 120000,
    "status": "HIRED",
    "applied_at": "2024-01-18T13:45:00Z",
    "notes": "Perfect match, excellent technical skills and experience",
    "created_at": "2024-01-18T13:45:00Z",
    "updated_at": "2024-02-05T14:20:00Z"
  },
  {
    "id": "app-014",
    "job_seeker_id": "js-005",
    "job_posting_id": "jp-001",
    "cover_letter": "I am applying for the Senior Full Stack Developer position. While my primary experience is in DevOps, I have strong programming skills and have built web applications and APIs. I have experience with React, Node.js, and cloud platforms. I am excited about the opportunity to work on full-stack development and contribute to scalable web applications.",
    "salary_expectation": 135000,
    "status": "UNDER_REVIEW",
    "applied_at": "2024-01-23T15:30:00Z",
    "notes": "Strong technical background, good potential for full-stack role",
    "created_at": "2024-01-23T15:30:00Z",
    "updated_at": "2024-01-26T11:45:00Z"
  },
  {
    "id": "app-015",
    "job_seeker_id": "js-005",
    "job_posting_id": "jp-002",
    "cover_letter": "I am interested in the AI/ML Engineer position. While my background is in DevOps, I have experience with machine learning infrastructure and MLOps. I have deployed ML models to production and have worked with data pipelines. I am excited about the opportunity to work on AI/ML engineering and contribute to building scalable AI infrastructure.",
    "salary_expectation": 110000,
    "status": "SUBMITTED",
    "applied_at": "2024-01-26T12:15:00Z",
    "notes": "Good MLOps experience, transitioning to ML engineering",
    "created_at": "2024-01-26T12:15:00Z",
    "updated_at": "2024-01-26T12:15:00Z"
  },
  {
    "id": "app-016",
    "job_seeker_id": "js-005",
    "job_posting_id": "jp-006",
    "cover_letter": "I am applying for the Project Manager position. My experience in DevOps has given me strong project management skills. I have coordinated with development teams, managed deployment schedules, and ensured successful project delivery. I am excited about the opportunity to focus specifically on project management and work on international projects.",
    "salary_expectation": 100000,
    "status": "REJECTED",
    "applied_at": "2024-01-29T14:00:00Z",
    "notes": "Not enough traditional project management experience",
    "created_at": "2024-01-29T14:00:00Z",
    "updated_at": "2024-02-03T10:15:00Z"
  }
]
