{
  "job_postings": [
    {
      "id": "job_001",
      "title": "Senior Full Stack Developer",
      "description": "We're looking for a Senior Full Stack Developer to join our growing engineering team. You'll be responsible for designing, developing, and maintaining our AI-powered enterprise solutions. This role involves working with cutting-edge technologies and collaborating with cross-functional teams to deliver high-quality software products.",
      "requirements": "Bachelor's degree in Computer Science or related field, 5+ years of experience in full-stack development, proficiency in React, Node.js, and Python, experience with cloud platforms (AWS/Azure), strong problem-solving skills, and excellent communication abilities.",
      "responsibilities": "Design and implement scalable web applications, collaborate with product managers and designers, mentor junior developers, participate in code reviews, optimize application performance, and contribute to technical architecture decisions.",
      "employment_type": "FULL_TIME",
      "experience_level": "SENIOR",
      "salary_min": 120000,
      "salary_max": 160000,
      "salary_currency": "USD",
      "location": "Austin, TX",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-15T23:59:59Z",
      "application_deadline": "2024-04-10T23:59:59Z",
      "view_count": 245,
      "application_count": 18,
      "published_at": "2024-01-10T09:00:00Z",
      "archived_at": null,
      "employer_id": "emp_001",
      "created_at": "2024-01-10T08:00:00Z",
      "updated_at": "2024-01-15T14:45:00Z"
    },
    {
      "id": "job_002",
      "title": "AI/ML Engineer",
      "description": "Join our AI team to develop and deploy machine learning models that power our enterprise solutions. You'll work on cutting-edge AI technologies, from natural language processing to computer vision, and help scale our AI infrastructure to serve millions of users.",
      "requirements": "Master's degree in Computer Science, Statistics, or related field, 3+ years of experience in machine learning, proficiency in Python, TensorFlow/PyTorch, experience with MLOps and cloud platforms, strong mathematical background, and experience with large-scale data processing.",
      "responsibilities": "Develop and train machine learning models, design and implement AI pipelines, collaborate with data scientists and engineers, optimize model performance, deploy models to production, and stay current with AI/ML research and trends.",
      "employment_type": "FULL_TIME",
      "experience_level": "MID",
      "salary_min": 100000,
      "salary_max": 140000,
      "salary_currency": "USD",
      "location": "San Francisco, CA",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-20T23:59:59Z",
      "application_deadline": "2024-04-15T23:59:59Z",
      "view_count": 189,
      "application_count": 12,
      "published_at": "2024-01-12T10:30:00Z",
      "archived_at": null,
      "employer_id": "emp_001",
      "created_at": "2024-01-12T09:30:00Z",
      "updated_at": "2024-01-15T14:45:00Z"
    },
    {
      "id": "job_003",
      "title": "Solar Energy Engineer",
      "description": "We're seeking a Solar Energy Engineer to design and optimize solar power systems for commercial and residential clients. You'll work on innovative renewable energy projects that contribute to a sustainable future and help reduce carbon emissions.",
      "requirements": "Bachelor's degree in Electrical Engineering, Mechanical Engineering, or related field, 4+ years of experience in solar energy systems, knowledge of solar panel technologies and inverters, experience with AutoCAD and solar design software, and understanding of electrical codes and regulations.",
      "responsibilities": "Design solar power systems for various applications, conduct site assessments and feasibility studies, create technical specifications and drawings, collaborate with installation teams, optimize system performance, and provide technical support to clients.",
      "employment_type": "FULL_TIME",
      "experience_level": "MID",
      "salary_min": 85000,
      "salary_max": 110000,
      "salary_currency": "USD",
      "location": "Denver, CO",
      "is_remote": false,
      "remote_type": "OFFICE_ONLY",
      "status": "PUBLISHED",
      "expires_at": "2024-04-25T23:59:59Z",
      "application_deadline": "2024-04-20T23:59:59Z",
      "view_count": 156,
      "application_count": 8,
      "published_at": "2024-01-08T11:00:00Z",
      "archived_at": null,
      "employer_id": "emp_002",
      "created_at": "2024-01-08T10:00:00Z",
      "updated_at": "2024-01-15T11:20:00Z"
    },
    {
      "id": "job_004",
      "title": "Wind Farm Project Manager",
      "description": "Lead wind energy projects from conception to completion. You'll manage large-scale wind farm developments, coordinate with stakeholders, ensure regulatory compliance, and oversee project budgets and timelines while contributing to our mission of sustainable energy production.",
      "requirements": "Bachelor's degree in Engineering, Business, or related field, 6+ years of project management experience in renewable energy, PMP certification preferred, experience with wind energy projects, strong leadership and communication skills, and knowledge of environmental regulations.",
      "responsibilities": "Manage wind farm development projects, coordinate with engineering teams and contractors, ensure compliance with environmental and safety regulations, manage project budgets and schedules, liaise with government agencies and stakeholders, and oversee project documentation.",
      "employment_type": "FULL_TIME",
      "experience_level": "SENIOR",
      "salary_min": 95000,
      "salary_max": 130000,
      "salary_currency": "USD",
      "location": "Houston, TX",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-30T23:59:59Z",
      "application_deadline": "2024-04-25T23:59:59Z",
      "view_count": 98,
      "application_count": 5,
      "published_at": "2024-01-14T13:00:00Z",
      "archived_at": null,
      "employer_id": "emp_002",
      "created_at": "2024-01-14T12:00:00Z",
      "updated_at": "2024-01-15T11:20:00Z"
    },
    {
      "id": "job_005",
      "title": "Medical Device Software Engineer",
      "description": "Develop software for life-saving medical devices and diagnostic tools. You'll work on FDA-regulated software systems that directly impact patient care and healthcare outcomes. This role combines software engineering with medical technology innovation.",
      "requirements": "Bachelor's degree in Computer Science, Biomedical Engineering, or related field, 3+ years of experience in medical device software development, knowledge of FDA regulations and IEC 62304, experience with C++, Python, and embedded systems, and understanding of medical device safety standards.",
      "responsibilities": "Develop software for medical devices and diagnostic tools, ensure compliance with FDA regulations and safety standards, participate in risk analysis and documentation, collaborate with clinical teams, conduct software testing and validation, and maintain software quality systems.",
      "employment_type": "FULL_TIME",
      "experience_level": "MID",
      "salary_min": 90000,
      "salary_max": 120000,
      "salary_currency": "USD",
      "location": "Boston, MA",
      "is_remote": false,
      "remote_type": "OFFICE_ONLY",
      "status": "PUBLISHED",
      "expires_at": "2024-04-18T23:59:59Z",
      "application_deadline": "2024-04-13T23:59:59Z",
      "view_count": 134,
      "application_count": 9,
      "published_at": "2024-01-09T14:00:00Z",
      "archived_at": null,
      "employer_id": "emp_003",
      "created_at": "2024-01-09T13:00:00Z",
      "updated_at": "2024-01-15T13:15:00Z"
    },
    {
      "id": "job_006",
      "title": "Clinical Data Analyst",
      "description": "Analyze clinical data to improve healthcare outcomes and support medical research. You'll work with large datasets from clinical trials and patient records to identify patterns, develop predictive models, and provide insights that drive medical innovation.",
      "requirements": "Master's degree in Biostatistics, Epidemiology, or related field, 2+ years of experience in clinical data analysis, proficiency in R, Python, and SQL, experience with clinical trial data, knowledge of statistical analysis methods, and understanding of healthcare data privacy regulations.",
      "responsibilities": "Analyze clinical trial and patient data, develop statistical models and predictive algorithms, create data visualizations and reports, collaborate with clinical research teams, ensure data quality and compliance, and present findings to stakeholders.",
      "employment_type": "FULL_TIME",
      "experience_level": "ENTRY",
      "salary_min": 70000,
      "salary_max": 90000,
      "salary_currency": "USD",
      "location": "San Diego, CA",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-22T23:59:59Z",
      "application_deadline": "2024-04-17T23:59:59Z",
      "view_count": 167,
      "application_count": 14,
      "published_at": "2024-01-11T15:30:00Z",
      "archived_at": null,
      "employer_id": "emp_003",
      "created_at": "2024-01-11T14:30:00Z",
      "updated_at": "2024-01-15T13:15:00Z"
    },
    {
      "id": "job_007",
      "title": "Blockchain Developer",
      "description": "Build the future of financial technology with blockchain and cryptocurrency solutions. You'll develop smart contracts, decentralized applications, and blockchain infrastructure that revolutionizes how people interact with financial services.",
      "requirements": "Bachelor's degree in Computer Science or related field, 3+ years of experience in blockchain development, proficiency in Solidity, JavaScript, and Python, experience with Ethereum, Bitcoin, or other blockchain platforms, knowledge of cryptography and distributed systems, and understanding of DeFi protocols.",
      "responsibilities": "Develop smart contracts and decentralized applications, design and implement blockchain solutions, conduct security audits and testing, collaborate with product teams, optimize blockchain performance, and stay current with blockchain technology trends.",
      "employment_type": "FULL_TIME",
      "experience_level": "MID",
      "salary_min": 110000,
      "salary_max": 150000,
      "salary_currency": "USD",
      "location": "New York, NY",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-28T23:59:59Z",
      "application_deadline": "2024-04-23T23:59:59Z",
      "view_count": 223,
      "application_count": 16,
      "published_at": "2024-01-13T16:00:00Z",
      "archived_at": null,
      "employer_id": "emp_004",
      "created_at": "2024-01-13T15:00:00Z",
      "updated_at": "2024-01-15T15:30:00Z"
    },
    {
      "id": "job_008",
      "title": "Financial Risk Analyst",
      "description": "Analyze financial risks and develop strategies to protect our digital payment platform. You'll work with large datasets to identify fraud patterns, assess credit risks, and develop models that ensure the security and stability of our financial services.",
      "requirements": "Bachelor's degree in Finance, Economics, Statistics, or related field, 4+ years of experience in financial risk analysis, proficiency in Python, R, and SQL, experience with machine learning for risk modeling, knowledge of financial regulations, and strong analytical and problem-solving skills.",
      "responsibilities": "Develop risk assessment models and fraud detection systems, analyze financial data and market trends, create risk reports and recommendations, collaborate with compliance and security teams, monitor risk metrics and KPIs, and implement risk mitigation strategies.",
      "employment_type": "FULL_TIME",
      "experience_level": "SENIOR",
      "salary_min": 95000,
      "salary_max": 130000,
      "salary_currency": "USD",
      "location": "London, UK",
      "is_remote": true,
      "remote_type": "HYBRID",
      "status": "PUBLISHED",
      "expires_at": "2024-04-26T23:59:59Z",
      "application_deadline": "2024-04-21T23:59:59Z",
      "view_count": 145,
      "application_count": 7,
      "published_at": "2024-01-15T17:00:00Z",
      "archived_at": null,
      "employer_id": "emp_004",
      "created_at": "2024-01-15T16:00:00Z",
      "updated_at": "2024-01-15T15:30:00Z"
    },
    {
      "id": "job_009",
      "title": "Educational Content Developer",
      "description": "Create engaging educational content for our learning platform. You'll develop interactive lessons, assessments, and multimedia content that makes learning accessible and enjoyable for students of all ages and backgrounds.",
      "requirements": "Bachelor's degree in Education, Instructional Design, or related field, 2+ years of experience in educational content development, experience with e-learning authoring tools, knowledge of instructional design principles, creativity and strong writing skills, and understanding of different learning styles.",
      "responsibilities": "Design and develop educational content and curricula, create interactive learning experiences, collaborate with subject matter experts, develop assessments and learning objectives, ensure content accessibility and inclusivity, and analyze learning outcomes and feedback.",
      "employment_type": "FULL_TIME",
      "experience_level": "ENTRY",
      "salary_min": 55000,
      "salary_max": 75000,
      "salary_currency": "USD",
      "location": "Seattle, WA",
      "is_remote": true,
      "remote_type": "FULLY_REMOTE",
      "status": "PUBLISHED",
      "expires_at": "2024-04-24T23:59:59Z",
      "application_deadline": "2024-04-19T23:59:59Z",
      "view_count": 89,
      "application_count": 11,
      "published_at": "2024-01-07T18:00:00Z",
      "archived_at": null,
      "employer_id": "emp_005",
      "created_at": "2024-01-07T17:00:00Z",
      "updated_at": "2024-01-15T12:45:00Z"
    },
    {
      "id": "job_010",
      "title": "VR/AR Learning Experience Designer",
      "description": "Design immersive virtual and augmented reality learning experiences that revolutionize education. You'll create interactive 3D environments, simulations, and educational games that make complex subjects accessible and engaging for learners.",
      "requirements": "Bachelor's degree in Game Design, Computer Science, or related field, 3+ years of experience in VR/AR development, proficiency in Unity, Unreal Engine, or similar platforms, experience with 3D modeling and animation, knowledge of educational technology, and strong creative and technical skills.",
      "responsibilities": "Design and develop VR/AR learning experiences, create 3D educational content and simulations, collaborate with educators and subject matter experts, optimize VR/AR applications for different devices, conduct user testing and iterate on designs, and stay current with VR/AR technology trends.",
      "employment_type": "CONTRACT",
      "experience_level": "MID",
      "salary_min": 80000,
      "salary_max": 110000,
      "salary_currency": "USD",
      "location": "Austin, TX",
      "is_remote": true,
      "remote_type": "FULLY_REMOTE",
      "status": "PUBLISHED",
      "expires_at": "2024-04-29T23:59:59Z",
      "application_deadline": "2024-04-24T23:59:59Z",
      "view_count": 67,
      "application_count": 6,
      "published_at": "2024-01-16T19:00:00Z",
      "archived_at": null,
      "employer_id": "emp_005",
      "created_at": "2024-01-16T18:00:00Z",
      "updated_at": "2024-01-15T12:45:00Z"
    }
  ]
}
